phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
/*
 * Phoenix-RTOS
 *
 * i.MX RT Flash server
 *
 * Copyright 2019-2023 Phoenix Systems
 * Author: Hubert Buczynski, Gerard Swiderski
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */

#include <endian.h>
#include <errno.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <sys/msg.h>
#include <sys/file.h>
#include <sys/threads.h>
#include <posix/utils.h>

#include <meterfs.h>
#include <ptable.h>
#include <board_config.h>

#include "fspi.h"
#include "flashdrv.h"
#include "imxrt-flashsrv.h"


/* clang-format off */
#define LOG_ERROR(str, ...) do { fprintf(stderr, __FILE__  ":%d error: " str "\n", __LINE__, ##__VA_ARGS__); } while (0)
#define TRACE(str, ...) do { if (0) fprintf(stderr, __FILE__  ":%d trace: " str "\n", __LINE__, ##__VA_ARGS__); } while (0)
/* clang-format on */

#define METERFS_STACKSZ   1024
#define THREAD_STACKSZ    1024
#define FLASH_MEMORIES_NO (FLEXSPI_COUNT)

#ifndef IMXRT_FLASH_PRIO
/*
 * Threads/processes including and below this priority must be run only from RAM to avoid preempting imxrt-flash
 * during write to flash, threads/processes above that priority shall be run either from XIP or RAM.
 */
#define IMXRT_FLASH_PRIO 3
#endif

/* clang-format off */
enum { flashsrv_memory_inactive = 0, flashsrv_memory_active = 0xff };
/* clang-format on */

typedef struct {
	ptable_part_t *pHeader;

	oid_t oid;
	uint8_t fID;
	uint8_t pStatus;

	void *fsCtx;
} flashsrv_partition_t;


typedef struct {
	flash_context_t ctx;
	flashsrv_partition_t *parts;

	uint32_t pCnt;
	uint8_t fStatus;
	uint8_t currPart;
	uint8_t rawActive;

	oid_t fOid;
	uint32_t rawPort;

	handle_t lock;
} flashsrv_memory_t;


struct {
	flashsrv_memory_t flash_memories[FLASH_MEMORIES_NO];
	uint32_t flexspi_addresses[FLASH_MEMORIES_NO];
	flashsrv_partitionOps_t ops;
} flashsrv_common;


/* Flash functions */

static int flashsrv_getFlashMemory(uint8_t fID, flashsrv_memory_t **pFlashMemory)
{
	flashsrv_memory_t *mem;

	if (FLASH_MEMORIES_NO <= fID) {
		return -EINVAL;
	}

	mem = flashsrv_common.flash_memories + fID;

	if (mem->fStatus == flashsrv_memory_inactive) {
		return -ENODEV;
	}

	*pFlashMemory = mem;

	return EOK;
}

/* Buffered access */

static ssize_t flashsrv_bufferedWrite(uint8_t fID, size_t offset, const void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_bufferedWrite(&mem->ctx, offset, data, size) : res;
}


static ssize_t flashsrv_bufferedRead(uint8_t fID, size_t offset, void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_bufferedRead(&mem->ctx, offset, data, size) : res;
}


static ssize_t flashsrv_bufferedSync(uint8_t fID)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_sync(&mem->ctx) : res;
}


/* Direct access */

static ssize_t flashsrv_directWrite(uint8_t fID, size_t offset, const void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_directWrite(&mem->ctx, offset, data, size) : res;
}


static ssize_t flashsrv_directRead(uint8_t fID, size_t offset, void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_directRead(&mem->ctx, offset, data, size) : res;
}


static int flashsrv_eraseSector(uint8_t fID, size_t offs)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_sectorErase(&mem->ctx, offs) : res;
}


static int flashsrv_chipErase(uint8_t fID)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_chipErase(&mem->ctx) : res;
}


/* Callbacks to meterfs - wrappers for basic flash functions */

static ssize_t flashsrv_fsWritef0(struct _meterfs_devCtx_t *devCtx, off_t offs, const void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directWrite(0, offs, buff, bufflen);
}


static ssize_t flashsrv_fsWritef1(struct _meterfs_devCtx_t *devCtx, off_t offs, const void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directWrite(1, offs, buff, bufflen);
}


static ssize_t flashsrv_fsReadf0(struct _meterfs_devCtx_t *devCtx, off_t offs, void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directRead(0, offs, buff, bufflen);
}


static ssize_t flashsrv_fsReadf1(struct _meterfs_devCtx_t *devCtx, off_t offs, void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directRead(1, offs, buff, bufflen);
}


static int flashsrv_fsEraseSectorf0(struct _meterfs_devCtx_t *devCtx, off_t offs)
{
	(void)devCtx;

	return flashsrv_eraseSector(0, offs);
}


static int flashsrv_fsEraseSectorf1(struct _meterfs_devCtx_t *devCtx, off_t offs)
{
	(void)devCtx;

	return flashsrv_eraseSector(1, offs);
}


static void flashsrv_devCtl(flashsrv_memory_t *memory, msg_t *msg)
{
	uint8_t fID;
	flash_i_devctl_t *idevctl = (flash_i_devctl_t *)msg->i.raw;
	flash_o_devctl_t *odevctl = (flash_o_devctl_t *)msg->o.raw;

	if (memory == NULL) {
		msg->o.err = -EINVAL;
		return;
	}

	fID = msg->oid.id;
	if (fID >= FLASH_MEMORIES_NO) {
		msg->o.err = -EINVAL;
		return;
	}

	switch (idevctl->type) {
		case flashsrv_devctl_properties:
			TRACE("imxrt-flashsrv: flashsrv_devctl_properties, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			odevctl->properties.size = memory->ctx.properties.size;
			odevctl->properties.psize = memory->ctx.properties.page_size;
			odevctl->properties.ssize = memory->ctx.properties.sector_size;
			odevctl->properties.offs = 0;
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_sync:
			TRACE("imxrt-flashsrv: flashsrv_devctl_sync, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			msg->o.err = flash_sync(&memory->ctx);
			break;

		case flashsrv_devctl_eraseSector:
			TRACE("imxrt-flashsrv: flashsrv_devctl_eraseSector - addr: %u, id: %u, port: %u.", idevctl->addr, msg->oid.id, msg->oid.port);
			if (idevctl->addr >= memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}
			flashsrv_eraseSector(memory->fOid.id, idevctl->addr);
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_erasePartition:
			TRACE("imxrt-flashsrv: flashsrv_devctl_eraseChip, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			flashsrv_chipErase(memory->fOid.id);
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_directWrite:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directWrite, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->addr, msg->i.size, msg->oid.id, msg->oid.port);

			if (idevctl->addr >= memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directWrite(memory->fOid.id, idevctl->addr, msg->i.data, msg->i.size);
			break;

		case flashsrv_devctl_directRead:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directRead, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->addr, msg->o.size, msg->oid.id, msg->oid.port);

			if (idevctl->addr >= memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directRead(memory->fOid.id, idevctl->addr, msg->o.data, msg->o.size);
			break;

		default:
			msg->o.err = -EINVAL;
			break;
	}
}


static void flashsrv_rawCtl(flashsrv_memory_t *memory, msg_t *msg)
{
	int i;
	uint32_t sNb;
	uint8_t partID;
	flash_i_devctl_t *idevctl = (flash_i_devctl_t *)msg->i.raw;
	flash_o_devctl_t *odevctl = (flash_o_devctl_t *)msg->o.raw;

	if (memory == NULL) {
		msg->o.err = -EINVAL;
		return;
	}

