phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
	partID = msg->oid.id;
	if (partID >= memory->pCnt) {
		msg->o.err = -EINVAL;
		return;
	}

	if (memory->parts[partID].pStatus == flashsrv_memory_inactive) {
		msg->o.err = -ENODEV;
		return;
	}

	switch (idevctl->type) {
		case flashsrv_devctl_properties:
			TRACE("imxrt-flashsrv: flashsrv_devctl_properties, id: %u, port: %u.", partID, msg->oid.port);
			odevctl->properties.size = memory->parts[partID].pHeader->size;
			odevctl->properties.psize = memory->ctx.properties.page_size;
			odevctl->properties.ssize = memory->ctx.properties.sector_size;
			odevctl->properties.offs = memory->parts[partID].pHeader->offset;
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_sync:
			TRACE("imxrt-flashsrv: flashsrv_devctl_sync, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			msg->o.err = flash_sync(&memory->ctx);
			break;

		case flashsrv_devctl_eraseSector:
			TRACE("imxrt-flashsrv: flashsrv_devctl_eraseSector - addr: %u, id: %u, port: %u.",
				idevctl->addr + memory->parts[partID].pHeader->offset, partID, msg->oid.port);

			if (idevctl->addr >= memory->parts[msg->oid.id].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			flashsrv_eraseSector(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->addr);
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_erasePartition:
			TRACE("imxrt-flashsrv: flashsrv_devctl_erasePartition, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			sNb = memory->parts[partID].pHeader->size / memory->ctx.properties.sector_size;

			for (i = 0; i < sNb; ++i) {
				flashsrv_eraseSector(memory->fOid.id, memory->parts[partID].pHeader->offset + i * memory->ctx.properties.sector_size);
			}

			msg->o.err = EOK;
			break;

		case flashsrv_devctl_directWrite:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directWrite, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->addr + memory->parts[partID].pHeader->offset, msg->i.size, msg->oid.id, msg->oid.port);

			if (idevctl->addr >= memory->parts[msg->oid.id].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directWrite(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->addr, msg->i.data, msg->i.size);
			break;

		case flashsrv_devctl_directRead:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directRead, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->addr + memory->parts[partID].pHeader->offset, msg->o.size, msg->oid.id, msg->oid.port);

			if (idevctl->addr >= memory->parts[msg->oid.id].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directRead(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->addr, msg->o.data, msg->o.size);
			break;

		default:
			msg->o.err = -EINVAL;
			break;
	}
}


/* Threads */

static void flashsrv_meterfsThread(void *arg)
{
	msg_t msg;
	msg_rid_t rid;

	flashsrv_partition_t *part = (flashsrv_partition_t *)arg;

	meterfs_i_devctl_t *idevctl = (meterfs_i_devctl_t *)msg.i.raw;
	meterfs_o_devctl_t *odevctl = (meterfs_o_devctl_t *)msg.o.raw;

	for (;;) {
		if (msgRecv(part->oid.port, &msg, &rid) < 0) {
			continue;
		}

		mutexLock(flashsrv_common.flash_memories[part->fID].lock);

		switch (msg.type) {
			case mtRead:
				flashsrv_common.flash_memories[part->fID].currPart = part->oid.id;
				msg.o.err = meterfs_readFile(msg.oid.id, msg.i.io.offs, msg.o.data, msg.o.size, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtWrite:
				flashsrv_common.flash_memories[part->fID].currPart = part->oid.id;
				msg.o.err = meterfs_writeFile(msg.oid.id, msg.i.data, msg.i.size, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtLookup:
				flashsrv_common.flash_memories[part->fID].currPart = part->oid.id;
				msg.o.err = meterfs_lookup(msg.i.data, &msg.o.lookup.fil.id, (meterfs_ctx_t *)part->fsCtx);
				msg.o.lookup.fil.port = part->oid.port;
				memcpy(&msg.o.lookup.dev, &msg.o.lookup.fil, sizeof(oid_t));
				break;

			case mtOpen:
				flashsrv_common.flash_memories[part->fID].currPart = part->oid.id;
				msg.o.err = meterfs_open(msg.oid.id, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtClose:
				flashsrv_common.flash_memories[part->fID].currPart = part->oid.id;
				msg.o.err = meterfs_close(msg.oid.id, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtDevCtl:
				flashsrv_common.flash_memories[part->fID].currPart = part->oid.id;
				msg.o.err = meterfs_devctl(idevctl, odevctl, (meterfs_ctx_t *)part->fsCtx);
				break;

			default:
				msg.o.err = -ENOSYS;
				break;
		}

		mutexUnlock(flashsrv_common.flash_memories[part->fID].lock);

		msgRespond(part->oid.port, &msg, rid);
	}
}


static int flashsrv_verifyRawIO(const flashsrv_memory_t *memory, msg_t *msg, size_t *size)
{
	if (memory->parts[msg->oid.id].pStatus == flashsrv_memory_inactive) {
		msg->o.err = -ENODEV;
		return -ENODEV;
	}

	if (memory->parts[msg->oid.id].pHeader->size <= msg->i.io.offs) {
		msg->o.err = -EINVAL;
		return -EINVAL;
	}

	if (memory->parts[msg->oid.id].pHeader->size < (msg->i.io.offs + *size)) {
		*size = memory->parts[msg->oid.id].pHeader->size - msg->i.io.offs;
	}

	return EOK;
}


static void flashsrv_rawThread(void *arg)
{
	int res;
	msg_t msg;
	msg_rid_t rid;
	uint32_t beginAddr;

	flashsrv_memory_t *memory = (flashsrv_memory_t *)arg;

	for (;;) {
		if (msgRecv(memory->rawPort, &msg, &rid) < 0) {
			continue;
		}

		mutexLock(memory->lock);

		if (msg.oid.id >= memory->pCnt) {
			msg.o.err = -EINVAL;
		}
		else {
			switch (msg.type) {
				case mtRead:
					res = flashsrv_verifyRawIO(memory, &msg, &msg.o.size);
					if (res == EOK) {
						beginAddr = memory->parts[msg.oid.id].pHeader->offset;
						msg.o.err = flashsrv_bufferedRead(memory->fOid.id, beginAddr + msg.i.io.offs, msg.o.data, msg.o.size);
					}
					else {
						msg.o.err = res;
					}
					break;

				case mtWrite:
					res = flashsrv_verifyRawIO(memory, &msg, &msg.i.size);
					if (res == EOK) {
						beginAddr = memory->parts[msg.oid.id].pHeader->offset;
						msg.o.err = flashsrv_bufferedWrite(memory->fOid.id, beginAddr + msg.i.io.offs, msg.i.data, msg.i.size);
					}
					else {
						msg.o.err = res;
					}
					break;

				case mtDevCtl:
					flashsrv_rawCtl(memory, &msg);
					break;

				case mtOpen:
					msg.o.err = 0;
					break;

