phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
		/* Initialize partitions */
		for (j = 0; j < memory->pCnt; ++j) {
			memory->parts[j].fID = i;
			memory->parts[j].oid.id = j;
			memory->parts[j].pHeader = ptable->parts + j;

			if (flashsrv_mountPart(&memory->parts[j]) < 0) {
				LOG_ERROR("imxrt-flashsrv: partition %s at flash %d is not mounted.", ptable->parts[j].name, i);
				memory->parts[j].pStatus = flashsrv_memory_inactive;
				free(memory->parts[j].fsCtx);
			}
		}

		res = flash_sync(&memory->ctx);
		if (res < 0) {
			return res;
		}
	}

	return EOK;
}


static int flashsrv_flashMemoriesInit(void)
{
	char path[32];
	int i, err = EOK;
	oid_t odir = { 0 };

	flashsrv_memory_t *memory;

	flashsrv_common.flexspi_addresses[0] = FLASH_EXT_DATA_ADDRESS;
	if (FLASH_MEMORIES_NO > 1) {
		flashsrv_common.flexspi_addresses[1] = FLASH_INTERNAL_DATA_ADDRESS;
	}

	/* Wait on root */
	while (lookup("/", NULL, &odir) < 0) {
		usleep(100000);
	}

	/* Initialize flash memories */
	for (i = 0; i < FLASH_MEMORIES_NO; ++i) {
		memory = flashsrv_common.flash_memories + i;

		if (mutexCreate(&memory->lock) != EOK) {
			return -ENOENT;
		}

		memory->fOid.id = i;
		snprintf(path, sizeof(path), "/dev/flash%d", memory->fOid.id);

		err = portCreate(&memory->fOid.port);
		if (err < 0) {
			LOG_ERROR("imxrt-flashsrv: portCreate %s - err: %d", path, err);
			return err;
		}

		err = portCreate(&memory->rawPort);
		if (err < 0) {
			LOG_ERROR("imxrt-flashsrv: portCreate %s.raw - err: %d", path, err);
			return err;
		}

		memory->rawActive = 0;
		memory->pCnt = 0;

		err = create_dev(&memory->fOid, path);
		if (err < 0) {
			LOG_ERROR("imxrt-flashsrv: create_dev %s - err: %d", path, err);
			return err;
		}

		memory->ctx.address = flashsrv_common.flexspi_addresses[i];

		err = flash_init(&memory->ctx);
		if (err == EOK) {
			memory->fStatus = flashsrv_memory_active;
		}
		else {
			memory->fStatus = flashsrv_memory_inactive;
			LOG_ERROR("imxrt-flashsrv: %s - has not been initialized correctly, err: %d.", path, err);
		}
	}

	return EOK;
}


static inline int isXIP(void *addr)
{
	uint32_t pc;
	__asm__ volatile("mov %0, pc"
					 : "=r"(pc));
	return pc >= (uint32_t)addr && pc < (uint32_t)addr + 0x10000000;
}


static int flashsrv_getProperties(uint8_t fID, flashsrv_properties_t *p)
{
	flashsrv_memory_t *mem;

	int res = flashsrv_getFlashMemory(fID, &mem);
	if (res == EOK) {
		mutexLock(mem->lock);
		p->size = mem->ctx.properties.size;
		p->psize = mem->ctx.properties.page_size;
		p->ssize = mem->ctx.properties.sector_size;
		p->offs = 0;
		mutexUnlock(mem->lock);
	}
	return res;
}


static ssize_t flashsrv_safeDirectWrite(uint8_t fID, size_t offset, const void *data, size_t size)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_directWrite(fID, offset, data, size);
	mutexUnlock(mem->lock);
	return ret;
}


static ssize_t flashsrv_safeDirectRead(uint8_t fID, size_t offset, void *data, size_t size)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_directRead(fID, offset, data, size);
	mutexUnlock(mem->lock);
	return ret;
}


static int flashsrv_safeSectorErase(uint8_t fID, size_t offs)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_eraseSector(fID, offs);
	mutexUnlock(mem->lock);
	return ret;
}


__attribute__((weak)) int flashsrv_customIntInit(flashsrv_partitionOps_t *ops)
{
	return EOK;
};


static int flashsrv_customInit(void)
{
	flashsrv_common.ops.read = flashsrv_safeDirectRead;
	flashsrv_common.ops.write = flashsrv_safeDirectWrite;
	flashsrv_common.ops.eraseSector = flashsrv_safeSectorErase;
	flashsrv_common.ops.getProperties = flashsrv_getProperties;

	return flashsrv_customIntInit(&flashsrv_common.ops);
}


int main(void)
{
	void *mem;

	if (isXIP((void *)FLEXSPI1_AHB_ADDR) || (FLASH_MEMORIES_NO > 1 && isXIP((void *)FLEXSPI2_AHB_ADDR))) {
		LOG_ERROR("imxrt-flashsrv: require to run driver from ram.\n");
		return EXIT_FAILURE;
	}

	priority(IMXRT_FLASH_PRIO);

	if (flashsrv_flashMemoriesInit() != EOK) {
		LOG_ERROR("imxrt-flashsrv: flash memories were not initialized correctly.\n");
		return EXIT_FAILURE;
	}

	if (flashsrv_partsInit() != EOK) {
		LOG_ERROR("imxrt-flashsrv: partitions were not initialized correctly.\n");
		return EXIT_FAILURE;
	}

	if (flashsrv_customInit() < 0) {
		LOG_ERROR("imxrt-flashsrv: custom init failed.\n");
	}

	printf("imxrt-flashsrv: initialized.\n");

	/* flashsrv_devThread handles requests associated with the whole single flash chip */
	if (FLASH_MEMORIES_NO > 1 && flashsrv_common.flash_memories[1].fStatus == flashsrv_memory_active) {
		mem = malloc(THREAD_STACKSZ);
		if (mem == NULL) {
			LOG_ERROR("imxrt-flashsrv: cannot alloc memory.");
			return EXIT_FAILURE;
		}
		beginthread(flashsrv_devThread, IMXRT_FLASH_PRIO, mem, THREAD_STACKSZ, (void *)&flashsrv_common.flash_memories[0]);
		flashsrv_devThread(&flashsrv_common.flash_memories[1]);
	}
	else if (flashsrv_common.flash_memories[0].fStatus == flashsrv_memory_active) {
		flashsrv_devThread(&flashsrv_common.flash_memories[0]);
	}
	else {
		printf("imxrt-flashsrv: end\n");
	}


	return EXIT_SUCCESS;
}
